#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_test.module.onestopauth.module.client_mytestprojectname-133.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7a23036b-733f-4899-b840-8e04ce9ad7b1]
module.keycloak_test.module.onestopauth.module.client_mytestprojectname-133.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f255d5a8-5e86-42ee-908d-c2b12670aaf7]
module.keycloak_test.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ad23c3dd-e865-4186-a3ee-c0f173612ca4]
module.keycloak_test.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f75de10b-e7c6-4ab7-94a4-4bf0d67e5ce9]
module.keycloak_test.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=792ceedf-b0bf-4ba5-a504-9fcbead39b2e]
module.keycloak_test.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d28fece3-857f-4d9f-b69d-5e8275deceb1]
module.keycloak_test.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f8295cf1-b797-481d-9d2c-7b540da7f902]
module.keycloak_test.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=71a8e7da-9811-4a5d-8e05-14853241eca3]
module.keycloak_test.module.onestopauth.module.client_demo-1-38.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=449de0bc-15fb-4e54-9ef2-76a427a1e7a0]
module.keycloak_test.module.onestopauth.module.client_demo-1-38.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=4d2d689e-1d8f-4772-a674-c583ccaf655c]
module.keycloak_test.module.onestopauth.module.client_demo-1-38.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d020fc9d-cbb5-4cfe-ada3-067a44254148]
module.keycloak_test.module.onestopauth.module.client_demo-1-38.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=5ce5e46e-388b-499d-93a1-99b9c42c475c]
module.keycloak_test.module.onestopauth.module.client_demo-1-38.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ad9dc8e1-8b03-453d-9123-103ca70f5bee]
module.keycloak_test.module.onestopauth.module.client_demo-1-38.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=67dcd0d2-84ec-4166-9538-869193717bb9]
module.keycloak_test.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=5dc95dc8-fa99-4854-9f59-94dba57486d4]
module.keycloak_test.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=06849d34-7848-42d9-8b99-64313a660098]
module.keycloak_test.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=e0a881d1-1cf2-4996-97b4-4efc8a834aa2]
module.keycloak_test.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2bd5ed98-4fd8-47e1-8146-d45470cbf31e]
module.keycloak_test.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=9c6dc704-9ff6-4d84-a239-f50bd285aa9f]
module.keycloak_test.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=a7e342e5-ee7d-40ba-aebe-c6ca3d5739f1]
module.keycloak_test.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=7dad912c-6240-41dd-af9c-77fe95b3eab5]
module.keycloak_test.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=3f59bd00-3986-404a-956b-12c9d4bc0a2a]
module.keycloak_test.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=1abddc22-2004-4541-ae56-b3d3043598d2]
module.keycloak_test.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8b085dc0-1114-49fb-a5ef-b1bd11a9ad37]
module.keycloak_test.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b4969680-f1bd-4168-b6c7-88335fb38b0f]
module.keycloak_test.module.onestopauth.module.client_aug-17-test-email-596.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=25f76ff9-6fe1-4cfd-bb95-cfce03654e34]
module.keycloak_test.module.onestopauth.module.client_aug-10-draft-468.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a6f63cb3-4251-4347-a28e-57698aa25e7d]
module.keycloak_test.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b9ef4435-f8b5-4bbf-b838-3a581d641f93]
module.keycloak_test.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=230c8ffc-783f-4442-9e64-0bcdc4c04e77]
module.keycloak_test.module.onestopauth.module.client_aug-10-draft-468.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a416ac11-3135-4960-a699-edde72cc995e]
module.keycloak_test.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=9b78416d-7df0-4fae-8ad6-3c3329635087]
module.keycloak_test.module.onestopauth.module.client_aug-10-draft-468.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=06037fe2-c30c-4ff0-b900-346a3fc7f910]
module.keycloak_test.module.onestopauth.module.client_aug-10-draft-468.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2ff20b2e-c4e1-4b65-9ad0-abcca2c91f0d]
module.keycloak_test.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ff962fc9-01f7-432e-a56f-2009405a51ef]
module.keycloak_test.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=96ca4e0a-cd09-4f99-9edf-757b2113c99b]
module.keycloak_test.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=fc15fdf7-2fbd-49c2-ac2d-6047e2134a25]
module.keycloak_test.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=dd6f4dfb-85ac-45d9-9d57-5b6ee14a7391]
module.keycloak_test.module.onestopauth.module.client_aug-10-draft-468.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=58f1944a-25ed-4d50-a2c9-bd0681727bae]
module.keycloak_test.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ca665e60-7ff0-4c79-864e-2f7ce18aa57b]
module.keycloak_test.module.onestopauth.module.client_test-6-340.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=03f25641-45cf-4394-9918-96587713cacb]
module.keycloak_test.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=3e70028b-753a-4385-9398-a69ed65f20ac]
module.keycloak_test.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=4a7bcc08-6394-4e72-ab50-cb5a82acdc12]
module.keycloak_test.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ce14196b-0dd9-4ee9-b98b-30daf991d409]
module.keycloak_test.module.onestopauth.module.client_aug-10-draft-468.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=769e182c-24cb-4df8-9130-1c6085aa298e]
module.keycloak_test.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=5ccad9cc-a9c7-41fe-8cb8-4ef0ef5440bf]
module.keycloak_test.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2e8f9fa0-bd63-42e3-b18e-c1fe89faec68]
module.keycloak_test.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=bb106d45-87f9-4bef-96b1-aec1da313533]
module.keycloak_test.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=58894161-338f-4b8b-8ca2-0bcd494ef5cb]
module.keycloak_test.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=30012bbe-3dbf-4a5b-95d3-f0828b00ea1c]
module.keycloak_test.module.onestopauth.module.client_6-test-for-release-v-1-70.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=1dd0a803-1faa-4f01-809a-4c82d3e267d5]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth.module.client_cypress-test-1687.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_cypress-test-1687.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_cypress-test-1687.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_cypress-test-1687.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "cypress-test-1687"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_cypress-test-1687.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_cypress-test-1687.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_cypress-test-1687.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "cypress-test-1687"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "cypress-test-1687"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://cypress",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_prod.module.onestopauth.module.client_cypress-test-1687.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_cypress-test-1687.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_cypress-test-1687.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_cypress-test-1687.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "cypress-test-1687"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_cypress-test-1687.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_cypress-test-1687.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_cypress-test-1687.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "cypress-test-1687"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "cypress-test-1687"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://cypress",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1687.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1687.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1687.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1687.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "cypress-test-1687"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1687.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1687.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1687.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "cypress-test-1687"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "cypress-test-1687"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://cypress",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

Plan: 21 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 2009 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*